---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.VertexPositionNormalColored.GetSizeInFloats
source: html/8d3b859d-0d60-c3a4-5139-263df660613e.htm
---
# Autodesk.Revit.DB.DirectContext3D.VertexPositionNormalColored.GetSizeInFloats Method

Gets the amount of storage that the vertex takes up in a buffer, measured in floats.

## Syntax (C#)
```csharp
public static int GetSizeInFloats()
```

## Returns
The number of floats occupied by one vertex of this type.